[
  {
    "slug": "embracing-the-marvel-of-aphantasia",
    "title": "Embracing the Marvel of Aphantasia",
    "date": "2023-07-09",
    "excerpt": "A journey through the mind of someone with aphantasia — exploring imagination, perception, and the beauty of seeing the world differently.",
    "tags": [
      "aphantasia",
      "neurodiversity",
      "imagination",
      "personal"
    ],
    "coverImage": "/images/wix/inline/embracing-the-marvel-of-aphantasia-1.jpg",
    "content": "# Embracing the Marvel of Aphantasia: A Journey of Imagination and Perception\n\n**By Adit Luthra**  \n*July 10, 2023 · 2 min read*\n\n![Cover Image](/images/wix/inline/embracing-the-marvel-of-aphantasia-1.jpg)\n\n---\n\n## Introduction\n\nHello, dear readers! Today, join me on a captivating exploration of **aphantasia** — a phenomenon that has shaped my perception of the world. Aphantasia, the condition where mental imagery is absent, presents a fascinating aspect of my existence — an unconventional lens through which I experience reality.\n\n## The Absence of Visual Imagery\n\nImagine a world where vivid mental images remain elusive. While many possess the ability to summon detailed pictures in their mind’s eye, my mental landscape lacks such visual richness. Initially, this may seem like a limitation — a missing piece in the puzzle of human experience. But, dear reader, I assure you that my journey through aphantasia has been far from dull.\n\n## My Childhood Encounter with Aphantasia\n\nLet me share a glimpse into my world — a moment from my elementary school days that exemplifies my experience. During a class activity, we were asked to visualize a mango. As my classmates closed their eyes, the teacher described every detail of the mango, urging us to envision it in our minds.\n\nHowever, as I attempted to picture it, I found myself unable to conjure any mental image. Puzzled, I questioned how I could \"see\" something that wasn't physically there. The teacher suggested I draw the mango instead — so I sketched it on paper, hoping to capture its essence. This incident left an indelible mark on my memory.\n\n## Later Realization and Embracing Aphantasia\n\nYears passed, and as I delved into the realms of hypnosis and meditation, the concept of mental imagery resurfaced. To my surprise, I still couldn’t visualize anything. Curiosity sparked within me, leading me on a journey of self-discovery.\n\nThrough extensive research, I stumbled upon the term **aphantasia**, and suddenly, the pieces fell into place. I realized that my experience of lacking mental imagery had a name — an identity that connected me to a community of individuals with similar perceptions. This realization ignited a profound sense of acceptance and empowerment.\n\n## Alternative Pathways of Imagination\n\nIn a visually dominated world, I have learned to embrace the beauty of alternative perception. Without mental imagery, my thoughts bloom through words and language. My imagination takes flight, relying on abstract reasoning, associations, and the interplay of ideas to create a rich tapestry of understanding.\n\n## Challenges and Insights\n\nYet, dear reader, my path has not been without its challenges. Aphantasia can be bewildering, shattering the assumption that everyone experiences the world similarly. The realization that my perception differs from the norm has been mind-shattering.\n\nHowever, let us not dwell solely on aphantasia’s intricacies. Instead, let us explore its broader implications for understanding the human experience. It compels us to question the nature of imagination, urging us to redefine creativity and appreciate the multitude of ways ideas manifest.\n\n## Embracing the Diversity of Human Experience\n\nI invite you, dear reader, to embrace the idiosyncrasies of your perception. Whether your mind conjures vivid imagery or ventures into uncharted territories like aphantasia, recognize the beauty that lies within the diversity of human experience.\n\n## Conclusion\n\nMy journey with aphantasia has been one of discovery and acceptance — a testament to the remarkable intricacies of human perception. Aphantasia, rather than a limitation, offers a unique lens through which we can explore the world.\n\nLet us celebrate the richness of diverse experiences and embrace the enchanting variations of the human mind.\n\n---\n\n**With boundless optimism and a zest for exploration,**  \n**Adit Luthra**"
  },
  {
    "slug": "embracing-uniqueness-the-art-of-being-a-weirdo",
    "title": "Embracing Uniqueness: The Art of Being a 'Weirdo'",
    "date": "2023-08-20",
    "excerpt": "An ode to the weirdos — this piece celebrates being different, embracing individuality, and thriving on your own path.",
    "tags": [
      "individuality",
      "personal-growth",
      "mindset",
      "weirdo"
    ],
    "coverImage": "/images/wix/inline/embracing-uniqueness-the-art-of-being-a-weirdo-1.jpeg",
    "content": "# Embracing Uniqueness: The Art of Being a \"Weirdo\"\n\n**By Adit Luthra**  \n*Aug 20, 2023 · 2 min read*\n\n![Embracing Uniqueness](/images/wix/inline/embracing-uniqueness-the-art-of-being-a-weirdo-1.jpeg)\n\n---\n\n## Introduction\n\nWelcome to a journey into the world of individuality, where the unconventional is celebrated, and the art of being a \"weirdo\" is a canvas for personal growth and empowerment. Today, I invite you to dive into the realm of embracing your uniqueness — a path I have walked, replete with challenges, triumphs, and a constant dance between self-doubt and self-discovery.\n\n---\n\n## The Paradox of Being Different\n\nIn a world that often values conformity, embracing one's peculiarities can be a daunting task. I've been no stranger to this paradox. Throughout my journey, my so-called \"weird\" interests, habits, and personality traits have often set me apart, inviting unwelcome stares and raising eyebrows.\n\nBut here's the revelation — being different is not just a label; it's a superpower. It's the key that unlocks perspectives, ignites innovation, and makes your journey distinctively your own.\n\n![Weirdness](/images/wix/inline/embracing-uniqueness-the-art-of-being-a-weirdo-2.jpeg)\n\n---\n\n## Turning Weirdness into a Badge of Honor\n\nMy path to embracing my uniqueness has been paved with instances where people didn't understand me or attempted to fit me into moulds I refused to squeeze into. Instead of retreating, I decided to wear my \"weirdness\" with pride.\n\nI made a conscious choice to dress in t-shirts that resonated with my comfort and sense of individuality. Each shirt became a canvas that reflected my thoughts, ideals, and occasionally quirky sense of humour. This simple act served as a daily reminder to embrace who I am, unabashedly.\n\n---\n\n## Defying the Traditional Path\n\nEducation is a journey that can be both enlightening and conforming. I realized that while many followed the traditional trajectory of obtaining a computer science degree, I had a different route in mind.\n\nI wanted to explore electronics and circuits — to understand the very intricacies that power our technological world. And so, I embarked on a path less travelled, pursuing electrical engineering — an endeavour that aligns more closely with my passions and aspirations.\n\n![EE Path](/images/wix/inline/embracing-uniqueness-the-art-of-being-a-weirdo-3.jpeg)\n\n---\n\n## Unveiling the Power of Genuine Connections\n\nNavigating social dynamics has been another intriguing facet of my journey. I've found that genuine connections often blossom from meaningful conversations, rather than the surface-level chit-chat that many find comfortable.\n\nEngage me in a dialogue about my interests, and you'll find my eyes light up with enthusiasm. However, small talk has never been my forte — it's a realm where I often feel out of place, like a square peg in a round hole.\n\n---\n\n## Embracing the Uncertainty\n\nAs I write this post, I can't help but admit that even today, I question my uniqueness. Is this blog an attempt to embrace it, or just another facet of my ongoing journey? It's a question that lingers.\n\nHowever, one thing remains certain — whenever I've embraced my individuality, remarkable things have unfolded. The moments of self-doubt become mere ripples in the sea of triumphs, for the power of being unique surpasses the challenges it brings.\n\n---\n\n## Conclusion\n\nIn the grand tapestry of existence, it's the threads of individuality that weave the most captivating patterns. The world needs more \"weirdos\" who dare to defy norms, shatter conventions, and ignite revolutions of thought.\n\nSo, if you're ever deemed \"different,\" wear that label like a crown. Embrace the quirks that make you who you are, for they are the brushstrokes on the canvas of your life — a canvas painted with the vibrant hues of innovation, authenticity, and growth.\n\n---\n\n### With an unwavering commitment to being extraordinary,  \n**Adit Luthra**"
  },
  {
    "slug": "i-am-sorry-hopeful-and-thankful-to-iit",
    "title": "I am Sorry, Hopeful and Thankful to IIT",
    "date": "2023-06-12",
    "excerpt": "A reflection on failure, effort, and the narrow definitions of merit. An open letter to IITs from a builder, dreamer, and engineer at heart.",
    "tags": [
      "jee",
      "engineering",
      "iit",
      "personal"
    ],
    "coverImage": "/images/wix/inline/i-am-sorry-hopeful-and-thankful-to-iit-1.jpg",
    "content": "# I am Sorry, Hopeful and Thankful to IIT\n\n**By Adit Luthra**  \n*Jun 12, 2023 · Updated: Jul 24, 2023 · 3 min read*\n\n![IIT Letter Cover](/images/wix/inline/i-am-sorry-hopeful-and-thankful-to-iit-1.jpg)\n\n---\n\n## I Apologize For\n\n- **Not being a rote learner.**  \n- **Maybe not achieving enough marks to have the pleasure of studying at your esteemed institutes.**  \n- **Maybe not sacrificing enough.**  \n- **Being a good engineer but possibly not good enough at a simple test.**\n\n---\n\n## I Sincerely Hope That\n\n- **The students who reach your institutes genuinely love engineering, just as I do.**  \n- **They appreciate your labs and facilities as I had hoped.**  \n- **They learn from the best, just like I aspired to.**  \n- **Maybe someday, I will actually be able to enjoy studying at your institutes.**\n\n---\n\n## I Am Thankful For\n\n- **Teaching me the value of hard work.**  \n- **Teaching me to multitask and effectively manage my time.**  \n- **Allowing me to fail and teaching me to accept it gracefully.**  \n- **The incredibly challenging Physics and Mathematics questions I have encountered in the past two years. They truly stimulated my mind and fostered growth.**\n\n---\n\nThese thoughts weigh heavily on my mind, and I genuinely hope that one day the IITs will devise a more inclusive method for admissions — one that is not confined to narrow criteria but encompasses a broader evaluation of students' character and genuine interest in the field, not just a single examination.\n\nOver the past six years, I have dedicated myself to engineering and innovation, working with Arduino, Raspberry Pi, Nvidia Jetson, and learning Linux and coding essentials. But I’ve realized these pursuits may not carry much weight in the admission process to institutions like the IITs.\n\nIt seems to matter little how many competitions I’ve won or how many innovations I’ve created — even if they were hosted by the IITs or BITS themselves. These achievements, which have shaped who I am, are often considered irrelevant.\n\nStill, I have no regrets.\n\nI poured my heart into everything I did, worked tirelessly, and learned immensely. If given the chance, I would do it all again — with the same passion and drive.\n\nThe competitions, the robots, the nights debugging code — they’ve moulded me. Maybe if IITs considered the **essence** of a candidate, not just their JEE Advanced score, there would be room for more students like me.\n\nAs I await results, uncertain of what comes next, I write this not to seek validation — but for closure. And perhaps, for others like me who believe engineering is more than an exam score.\n\nIn the future, I hope reservations will be granted to those who possess **extraordinary abilities and contributions** in their respective fields, beyond caste or lineage.\n\nI know this may never get a reply. But that’s okay.\n\nThis letter is for me, and maybe for someone out there who needed to hear it.\n\n---\n\n**This was JEE Aspirant 2023 – Adit Luthra**  \n*Grade 12, aiming for Electronics and Communication Engineering.*\n\nAs I close this chapter, I retire this identity in search of something more. Something deeper. Something that matters.\n\n---\n\n### In conclusion, I want to express:  \n**I am sorry, hopeful, and grateful.**"
  },
  {
    "slug": "the-artful-alchemy-of-science-where-creativity-ignites-discovery",
    "title": "The Artful Alchemy of Science: Where Creativity Ignites Discovery",
    "date": "2023-10-07",
    "excerpt": "Explore the mesmerizing intersection where science meets art — from space telescopes to golden ratios, nature’s poetry, and the technology of tomorrow.",
    "tags": [
      "creativity",
      "science",
      "design",
      "nature"
    ],
    "coverImage": "/images/wix/inline/the-artful-alchemy-of-science-where-creativity-ignites-discovery-1.jpeg",
    "content": "# The Artful Alchemy of Science: Where Creativity Ignites Discovery\n\n**By Adit Luthra**  \n*Oct 8, 2023 · 3 min read*\n\n![Cover](/images/wix/inline/the-artful-alchemy-of-science-where-creativity-ignites-discovery-1.jpeg)\n\n---\n\n## Introduction\n\n**Greetings, fellow seekers of knowledge and wonder,**\n\nFirst, I must extend my heartfelt apologies for the longer-than-expected break. Life took me on an unexpected journey, and I appreciate your patience during this brief hiatus. But fear not, dear readers, for something incredible is on the horizon, and I can hardly contain my excitement.\n\nToday, I extend to you an invitation to embark on a captivating journey. It's a journey that defies the conventional boundaries of art and science — a realm where creativity takes the lead, and discovery follows closely behind. This is a voyage into the mesmerizing domain where these seemingly distinct fields merge, fusing into a symphony of inspiration and innovation.\n\n---\n\n## The Cosmic Canvas: James Webb's Space Odyssey\n\n![JWST 1](/images/wix/inline/the-artful-alchemy-of-science-where-creativity-ignites-discovery-2.jpg)  \n![JWST 2](/images/wix/inline/the-artful-alchemy-of-science-where-creativity-ignites-discovery-4.jpg)   \n![JWST 3](/images/wix/inline/the-artful-alchemy-of-science-where-creativity-ignites-discovery-6.jpg)  \nImagine the cosmos as a vast canvas, stretching beyond the limits of imagination. Now, visualize the James Webb Space Telescope as the artist's brush, dipped into the ink of space to craft breathtaking masterpieces. Webb's lens captures not just scientific data but the very essence of cosmic beauty, redefining our understanding of the universe.\n\nThese celestial portraits — featuring distant galaxies, nebulae, and stars — transcend mere scientific records. They are visual poetry, inviting us to dance with the cosmos. In every image, we find not just science, but artistry that ignites curiosity and fuels our passion for exploration.\n\n---\n\n## Science's Hidden Artistry: The Enigmatic Golden Ratio\n\nScience is not a dry collection of facts; it is a vibrant tapestry woven with hidden patterns. Consider the intricate dance of electric currents through conductors — a choreography unseen to the naked eye. These patterns, like brushstrokes on a canvas, unveil nature's underlying order.\n\nAnd then, there's the enigmatic Golden Ratio, represented by the Greek letter Phi (φ). It's a mathematical marvel that transcends equations, manifesting in art, architecture, and the natural world. From the spirals of galaxies to the swirls of seashells, this ratio defines beauty in precise proportions. It's a testament to the exquisite marriage of art and science.\n\n---\n\n## Tech Unleashed: Bridging Imagination and Innovation\n\nIn our modern world, technology is the canvas upon which innovation paints its masterpieces. Life-saving medical devices, renewable energy solutions, and global connectivity aren't just inventions; they are works of art — the elegant strokes of engineering creativity.\n\nConsider your smartphone. More than a gadget, it's an embodiment of design excellence, connecting hearts and minds worldwide. Wind turbines, towering with grace, transform the power of nature into a symphony of sustainability. In these marvels, technology and art entwine, shaping our lives and the future.\n\n---\n\n## Nature's Masterpieces: Patterns in Every Breath\n\nNature herself is the ultimate artist, her creations a source of boundless inspiration. Take butterfly wings, for instance. Their vibrant hues don't arise from pigments but from intricate microstructures manipulating light. These wings are a testament to the fusion of biology and artistry.\n\nThink of the mesmerizing patterns crafted by ocean waves — a choreographed ballet of water. These patterns, mirrored in seashells and dunes, captivate both artists and scientists. They've inspired architects to design innovative buildings and engineers to develop efficient transportation systems.\n\n---\n\n## Conclusion: Embrace the Intersection\n\nAs we journey through this intersection of art and science, we discover a profound truth: creativity and discovery are not separate entities but harmonious companions. They coexist, propelling us towards innovation and deeper understanding.\n\nIn the captivating images from the James Webb Space Telescope, in the hidden patterns of science, in the technology shaping our lives, and in the artistry of nature — we find more than knowledge. We find boundless inspiration. This is an invitation to embrace the world through the eyes of both artists and scientists — where every revelation is a stroke of genius, and every innovation is a masterpiece.\n\nTo the young minds among us, take heed: science isn't a collection of dry facts; it's an exhilarating exploration of art, design, and the awe-inspiring beauty that awaits.\n\n---\n\n**With unwavering curiosity,**  \n**Adit Luthra**"
  },
  {
    "slug": "the-cypherpunk-revolution",
    "title": "The Cypherpunk Revolution",
    "date": "2023-07-23",
    "excerpt": "A digital manifesto on data ownership, encryption, and the growing fight for privacy in a surveillance-driven internet. Join the revolution.",
    "tags": [
      "privacy",
      "cypherpunk",
      "data sovereignty",
      "cryptography"
    ],
    "coverImage": "/images/wix/inline/the-cypherpunk-revolution-1.jpg",
    "content": "# The Cypherpunk Revolution: Taking Back Control of Your Data\n\n**By Adit Luthra**  \n*Jul 24, 2023 · 3 min read*\n\n---\n\n### Introduction\n\n**Data has become a powerful currency in the digital age**, wielded by platforms like Facebook, LinkedIn, and YouTube as a bargaining chip to support their advertising sales. As businesses invest billions in targeted advertising, personal data sets provide valuable insights into individual preferences, affiliations, politics, and more.\n\nHowever, this vast data collection comes at a cost — attracting criminals who steal personal data for illicit purposes. Understanding the true worth of personal data and its value in the market is crucial as we navigate the realm of data privacy and security.\n\n![Cypherpunk](/images/wix/inline/the-cypherpunk-revolution-1.jpg)\n\n---\n\n### The Cypherpunk Revolution: A Stand for Digital Freedom\n\nAmidst the data-driven advertising world, a revolutionary movement has emerged — **the Cypherpunk Revolution**.\n\nCypherpunks are digital freedom fighters who advocate for robust privacy measures and data protection through encryption and cryptography. Their mission is to empower individuals with tools and knowledge to safeguard their digital selves from corporate exploitation and government surveillance.\n\n---\n\n### My Journey as a Cypherpunk: Unraveling the World of Digital Empowerment\n\nIt all began with a startling revelation — the value of personal data, or rather, its shockingly low price in the dark realms of cybercrime.\n\nThe fact that our entire lives — locations, photographs, memories, livelihoods — could be bought and sold for just a few dollars sent shivers down my spine. It was a wake-up call that ignited a fire within me to explore the world of data privacy and digital security.\n\nAs I delved deeper, I discovered **blockchain and cryptography**. These revolutionary technologies held the key to unlocking digital freedom and empowering individuals to protect their privacy and data sovereignty.\n\nWhat started as curiosity became a mission — a quest to understand the power of encryption and its potential to reshape our digital landscape.\n\n---\n\n### Taking Control of Your Data\n\nThe value of personal data fluctuates based on supply and demand, with different demographics and markets evaluated differently. However, one truth remains:\n\n> **The power of personal data is in your hands.**\n\nJoining the Cypherpunk Revolution means taking back control of your data and understanding its true worth.\n\n![Dark Web Data](/images/wix/inline/the-cypherpunk-revolution-2.jpg)\n\n---\n\n### Understanding Data’s True Worth\n\nData breaches and illicit markets illustrate the monetary value of personal data:\n\n- A hacked Facebook account can be sold for **$65**  \n- A complete healthcare record can fetch **$250+**\n\nData thieves capitalize on full datasets, making healthcare breaches increasingly common and profitable.\n\n---\n\n### Harnessing Data for Advertising\n\nPlatforms and businesses use personal data in two main ways:\n\n1. **Direct Advertising** – Targeting specific individuals by preferences and demographics  \n2. **Predictive Analytics** – Spotting trends and forecasting market behavior\n\nThese systems help businesses refine products and messaging — fueling a $139.8 billion industry in 2020 alone. And it's growing — all powered by your data.\n\n---\n\n### Your Data. Your Rules.\n\nCompanies collect data through every click and scroll. But the reality is:\n\n- **You are treated as a data point, not a person**\n- **They own your data just because it lives on their platform**\n\nThis philosophy is in **direct conflict** with what we believe:\n\n> People should **own their data**, know **what’s collected**, and decide **what happens to it** — relocate it, revoke it, or delete it.\n\n---\n\n### Conclusion\n\nThe **Cypherpunk Revolution** is a powerful reminder: your personal data is a **precious asset** — and it deserves respect.\n\nBy embracing encryption and privacy-enhancing technologies, we regain control and protect our digital sovereignty.\n\nAs consumers, we must demand transparency. As digital citizens, we must take back ownership.\n\nLet us stand united in the pursuit of **digital freedom** — where privacy is respected, control is yours, and exploitation ends.\n\n---\n\n### Seize Your Data Destiny  \n**Join the Cypherpunk Revolution. Take control. Own your future.**\n\n**– Adit Luthra**"
  },
  {
    "slug": "unleashing-the-art-of-culinary-creation",
    "title": "Unleashing the Art of Culinary Creation",
    "date": "2023-08-06",
    "excerpt": "A warm, flavorful reflection on how cooking became more than just a hobby — a source of calm, science, creativity, and soulful expression.",
    "tags": [
      "cooking",
      "creativity",
      "personal",
      "culinary"
    ],
    "coverImage": "/images/wix/inline/unleashing-the-art-of-culinary-creation-1.jpg",
    "content": "# Unleashing the Art of Culinary Creation: Cooking as a Stress Buster and Soulful Escape\n\n**By Adit Luthra**  \n*Aug 7, 2023 · 2 min read*\n\n![Culinary Cover](/images/wix/inline/unleashing-the-art-of-culinary-creation-1.jpg)\n\n---\n\n## Introduction\n\nWelcome to a delightful journey through the heartwarming world of culinary creation, where cooking becomes a cherished hobby and a soulful escape from the hustle and bustle of everyday life. Today, I invite you to explore the joy of cooking — a culinary adventure that brings inner peace and ignites a sense of creativity.\n\n---\n\n## Cooking as a Stress Buster\n\nIn the fast-paced modern world, cooking serves as a tranquil sanctuary where I find solace amidst the chaos. The kitchen becomes my retreat — a place to unwind and let go of stress.\n\nEngaging in the rhythmic chopping of vegetables, the gentle seasoning of spices, and the artful arrangement of ingredients is a meditative practice that calms my mind and rejuvenates my spirit.\n\n---\n\n## The Science of Cooking\n\nBehind every dish lies a fascinating science that I have come to appreciate. The chemistry of ingredients, the physics of heat transfer, and the biological transformation of flavours during cooking add a whole new dimension to this culinary journey.\n\nUnderstanding the science behind cooking empowers me to experiment, tweak, and create new flavours that tantalize the taste buds.\n\n![Cooking Science](/images/wix/inline/unleashing-the-art-of-culinary-creation-2.jpg)\n\n---\n\n## A Hobby with an Artistic Flair\n\nCooking, for me, is an art form that transcends the boundaries of traditional painting or dance. The canvas is my kitchen counter, and each ingredient becomes a stroke of flavour, texture, and colour.\n\nLike a painter who mixes pigments to craft masterpieces, I blend spices and herbs to compose a symphony of tastes that captivate the senses.\n\n---\n\n## Appreciating the Art of Presentation\n\nWhile I may not be an expert in food presentation, I deeply admire dishes that are beautifully arranged. Just like a captivating painting or an enchanting theatre performance, a well-presented plate can evoke emotion and create lasting memories.\n\nThe visual appeal enhances the dining experience — making every meal not just nourishing, but memorable.\n\n---\n\n## Conclusion\n\nCooking, my beloved hobby, unfolds as a harmonious escape — a beautiful amalgamation of stress relief, scientific exploration, and artistic flair.\n\nIn the heart of the kitchen, I find a sanctuary of creativity that brings joy and satisfaction to my soul. Cooking is not just about preparing meals; it is a way of expressing myself, experimenting with flavours, and finding peace in a world that never stops.\n\nWith each culinary creation, I nurture my love for the art of cooking and discover new dimensions of flavour and inspiration.\n\n---\n\n### With culinary love and a zest for creation,  \n**Adit Luthra**"
  },
  {
    "slug": "welcome-to-my-brain",
    "title": "Welcome to my Brain!!!",
    "date": "2022-05-11",
    "excerpt": "The first transmission from the Galactic God — tech, life, aphantasia, and building the impossible. Welcome to the chaotic, beautiful journey.",
    "tags": [
      "personal",
      "manifesto",
      "intro",
      "life"
    ],
    "coverImage": "/images/wix/inline/welcome-to-my-brain-1.jpg",
    "content": "# Welcome to my Brain!!!\n\n**By Adit Luthra**  \n*May 11, 2022 · 1 min read*\n\n---\n\n> _I would like to welcome the world to my blog. Here I will talk about Technology, Science, Math, Life, Philosophy and the world in general._\n\n![Welcome Cover](/images/wix/inline/welcome-to-my-brain-1.jpg)\n\n---\n\n**For those who don't know me, I am Adit Luthra. I call myself the Galactic God.**\n\nLet me tell you a little about myself:\n\n- I am a **technology lover**.  \n- I love to **create new stuff**.  \n- I love to **learn**.  \n- I would like to **save the world someday**.  \n- I want to **create a world that I am excited to live in**.  \n- I want to **build a new city or island** someday — a model city.  \n- I am a **cypherpunk**.  \n- I love **meeting intelligent people**.  \n- I am **considered crazy by most**.  \n- I love to **do what others call impossible**.  \n- I believe in a **gender- and religion-neutral world**.  \n- I have **Aphantasia**.  \n- I strongly believe in the **power of AI and Blockchain**.\n\n---\n\nNow that you know the highlights of Adit Luthra, let's get started.\n\nI’ll be using this blog like a notebook — a mirror to my mind — and invite you to join me on this journey as I pursue whatever I set out to do in this life.\n\nYou’ll watch my short-term goals evolve, but my long-term ones?  \nThey’ll stay rooted in something deeper.\n\n---\n\n**I HOPE!!**"
  }
]